app/controllers/reviews_controller.rb

SELECT "categories".* FROM "categories"
SELECT "reviews".* FROM "reviews"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Sports"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 2]]
---
    def index
    if params[:category].blank?
			@reviews = Review.all.order("created_at DESC")
	     else
			@category_id = Category.find_by(name: params[:category]).id
			@reviews = Review.where(:category_id => @category_id).order("created_at DESC")

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
       @review = Review.find(params[:id])

SELECT "categories".* FROM "categories"
---
    def new
        @review = current_user.reviews.build
        @categories = Category.all.map{ |c| [c.name, c.id] }

INSERT INTO "reviews" ("headline", "summary", "link", "writer", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @review = current_user.reviews.build(review_params)
        @review.category_id = params[:category_id]

        if @review.save

SELECT "categories".* FROM "categories"
---
    def edit
        @categories = Category.all.map{ |c| [c.name, c.id] }

UPDATE "reviews" SET "headline" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["headline", "Life of Black Tiger Review – The Worst PS4 Game In The World Ever!!"], ["updated_at", "2017-01-30 22:33:42.113505"], ["id", 1]]
---
    def update
        @review.category_id = params[:category_id]
        if @review.update(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 7]]
---
      def find_review
         @review = Review.find(params[:id])